
{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "risk_assessment_model",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 64,
            "activation": "relu",
            "input_shape": [12]
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "rate": 0.3
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 32,
            "activation": "relu"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 16,
            "activation": "relu"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 2,
            "activation": "sigmoid"
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": ["risk_assessment_weights.bin"],
      "weights": [
        {"name": "dense/kernel", "shape": [12, 64], "dtype": "float32"},
        {"name": "dense/bias", "shape": [64], "dtype": "float32"},
        {"name": "dense_1/kernel", "shape": [64, 32], "dtype": "float32"},
        {"name": "dense_1/bias", "shape": [32], "dtype": "float32"},
        {"name": "dense_2/kernel", "shape": [32, 16], "dtype": "float32"},
        {"name": "dense_2/bias", "shape": [16], "dtype": "float32"},
        {"name": "dense_3/kernel", "shape": [16, 2], "dtype": "float32"},
        {"name": "dense_3/bias", "shape": [2], "dtype": "float32"}
      ]
    }
  ]
}
